config/org-mode.org


Ici, je veux utiliser org mode.

Par contre, mon second cerveau utilise une partie d'org-mode et org-roam.
J'active donc les parties de org-mode qd il faut, et org-roam seulement si ya mon braindump


* Config + code final

** Variables de chemins et autres utile dans tous les cas

*** Lieu de mon dossier org-directory (tout se base sur lui)

#+begin_src emacs-lisp
  (setq org-directory (expand-file-name "org/" braindump-directory))
#+end_src

*** Lieu du org-roam-directory

#+begin_src emacs-lisp
(setq org-roam-directory org-directory)
#+end_src

*** Lieu de mon dossier de bibliographie

#+begin_src emacs-lisp


  (setq bibliography-directory (expand-file-name "dossierCitation/" config-directory))
  ;; (setq my-bibliography-list (list (expand-file-name "dossierCitation/biblio.bib" bibliography-directory)
                                   ;; "/path/to/another/"
                                   ;; "/path/to/another/"
                                   ;; ))
#+end_src

** La bibliothèque d'automatisations des choses (à placer tôt) 

=Si c'est le premier lancement, faire un (org-roam-db-sync 'force), puis syncroniser la database=

À mettre à un endroit (org-roam-db-sync 'force) pour termux automatiquement

#+begin_src emacs-lisp
   (use-package vulpea
     :if braindump-exists
     :straight (vulpea
                :type git
                :host github
                :repo "d12frosted/vulpea")
     ;; hook into org-roam-db-autosync-mode you wish to enable
     ;; persistence of meta values (see respective section in README to
     ;; find out what meta means)
     :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))
     :config
     (defun org-roam-vulpea-bdd ()
       (interactive)
       "Mets à jour la bdd pour l'utilisation de velpua"
       (org-roam-db-sync 'force)
       )
     )
   (require 'vulpea);;sinon ne charge pas tout je comprends pas pk
#+end_src


** Org-mode

*** Choses toujours présentes (pour l'édition n'importe où notamment)
**** Optimisation de bases
***** Les TODO en done quand tous les sous arbres sont done
#+begin_src emacs-lisp
     (defun org-summary-todo (n-done n-not-done)
       "Switch entry to DONE when all subentries are done, to TODO otherwise."
       (let (org-log-done org-log-states)   ; turn off logging
         (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

     (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+end_src

Pour les checkbox
    #+begin_src emacs-lisp
	    (defun my/org-checkbox-todo ()
	      "Switch header TODO state to DONE when all checkboxes are ticked, to TODO otherwise"
	      (let ((todo-state (org-get-todo-state)) beg end)
		(unless (not todo-state)
		  (save-excursion
		(org-back-to-heading t)
		(setq beg (point))
		(end-of-line)
		(setq end (point))
		(goto-char beg)
		(if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]"
			       end t)
		    (if (match-end 1)
		    (if (equal (match-string 1) "100%")
			(unless (string-equal todo-state "DONE")
			  (org-todo 'done))
		      (unless (string-equal todo-state "TODO")
			(org-todo 'todo)))
		      (if (and (> (match-end 2) (match-beginning 2))
			   (equal (match-string 2) (match-string 3)))
		      (unless (string-equal todo-state "DONE")
			(org-todo 'done))
		    (unless (string-equal todo-state "TODO")
		      (org-todo 'todo)))))))))
      
      (add-hook 'org-checkbox-statistics-hook 'my/org-checkbox-todo)
    #+end_src

***** Better templates / <el shortcutt

Now, you can type "<el or <sh" then "tab", and let's go for org-babel !


#+begin_src emacs-lisp
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("cd" . "src C"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))
#+end_src

***** TODO Pour insérer du sons + Jouer un son quand Done

#+begin_src emacs-lisp :tangle no

  ;; pour insérer un son
  (use-package emms)
  (emms-all)
  (emms-default-players)
  ;; (setq emms-source-file-default-directory "~/Notes/Roam/sounds")
  (use-package org-emms)

  ;; pour le done
  (defun my-org-after-todo-state-change ()
    (when (string-equal org-state "DONE")
      (org-clock-out-if-current)
      (emms-add-file "~/.emacs.d/sound/done.mp3")
      (emms-start)
      ;; (emms-play-file "/home/msi/.emacs.d/sound/done.mp3")
      )
    )

  (add-hook 'org-after-todo-state-change-hook 'my-org-after-todo-state-change)


#+end_src
***** Pour avoir une barre de navigation sur le côté

#+begin_src emacs-lisp
(use-package org-sidebar)
#+end_src
***** Pour insérer un nouveau titre comme le précédent visible 

Si je fait avec C-u, alors org-insert-heading !

#+begin_src emacs-lisp

  ;;chargement d'une bibliothèque
  ;; (add-to-list 'org-modules 'org-fold)

  (defun org-meta-return (&optional arg)
    "Insert a new heading or wrap a region in a table.
    Calls `org-insert-heading', `org-insert-item' or
    `org-table-wrap-region', depending on context.  When called with
    an argument, unconditionally call `org-insert-heading'."
    (interactive "P")
    ;; (org-fold-check-before-invisible-edit 'insert)
    (or (run-hook-with-args-until-success 'org-metareturn-hook)
        (call-interactively (cond (arg #'org-insert-heading)
                                  (current-prefix-arg #'org-insert-heading)
                                  ((org-at-table-p) #'org-table-wrap-region)
                                  ((org-in-item-p) #'org-insert-item)
                                  (t #'org-insert-heading-after-current)))))
#+end_src

***** Ne pas éditer qd le heading est plié

#+begin_src emacs-lisp
(setq-default org-catch-invisible-edits nil)
#+end_src

**** Esthétique d'org-mode
***** Petite bulles des titres

#+begin_src emacs-lisp 

    ;; (use-package org-bullets
    ;; :after org
    ;; :hook(org-mode . org-bullets-mode)
    ;; :config

    ;; (setq org-bullets-bullet-list '("◉" "✸" "☯" "✿" "✜" "◆" "▶"))
    ;; (setq org-bullets-bullet-list '("◉" "○" "✸" "✜" "◆" "▶"))
    ;; )

  (use-package org-superstar
      :after org
      :hook (org-mode . org-superstar-mode)
      :config
      (setq org-superstar-headline-bullets-list '("◉" "○" "✸" "✜" "◆" "▶"))
        ;; (set-face-attribute 'org-superstar-header-bullet nil :inherit 'fixed-pitched :height 200)
      
      ;; :custom
      ;; set the leading bullet to be a space. For alignment purposes I use an em-quad space (U+2001)
      ;; (org-superstar-headline-bullets-list '(" "))
      ;; (org-superstar-todo-bullet-alist '(("DONE" . ?✔)
                                         ;; ("TODO" . ?⌖)
                                         ;; ("NEXT" . ?)
                                         ;; ("ISSUE" . ?)
                                         ;; ("BRANCH" . ?)
                                         ;; ("FORK" . ?)
                                         ;; ("MR" . ?)
                                         ;; ("MERGED" . ?)
                                         ;; ("GITHUB" . ?A)
                                         ;; ("WRITING" . ?✍)
                                         ;; ("WRITE" . ?✍)
                                         ;; ))
      ;; (org-superstar-special-todo-items t)
      ;; (org-superstar-leading-bullet "")

      )







#+end_src

***** Org emphasis (surligné, souligné etc)
****** Couleurs
#+begin_src emacs-lisp 

  (setq org-emphasis-alist
	'(("*" bold)
	  ("/" italic)
	  ("_" underline)
	  ("=" (:foreground "yellow")) ;;on ne peut pas surligner lors de l'export
	  ("~" org-code verbatim)
	  ("+" (:strike-through t))))

  (defface my-org-emphasis-bold
    '((default :inherit bold)
      (((class color) (min-colors 88) (background light))
       :foreground "#a60000")
      (((class color) (min-colors 88) (background dark))
       :foreground "#ff8059"))
    "My bold emphasis for Org.")

  (defface my-org-emphasis-italic
    '((default :inherit italic)
      (((class color) (min-colors 88) (background light))
       :foreground "#005e00")
      (((class color) (min-colors 88) (background dark))
       :foreground "#44bc44"))
    "My italic emphasis for Org.")

  (defface my-org-emphasis-underline
    '((default :inherit underline)
      (((class color) (min-colors 88) (background light))
       :foreground "#813e00")
      (((class color) (min-colors 88) (background dark))
       :foreground "#d0bc00"))
    "My underline emphasis for Org.")

  (defface my-org-emphasis-strike-through
    '((((class color) (min-colors 88) (background light))
       :strike-through "#972500" :foreground "#505050")
      (((class color) (min-colors 88) (background dark))
       :strike-through "#ef8b50" :foreground "#a8a8a8"))
    "My strike-through emphasis for Org.")


#+end_src

