config/org-mode.org
****** Pour voir directement les liens, faire disparaître l'emphasis

#+begin_src emacs-lisp 

  (setq org-hide-emphasis-markers t)
  (straight-use-package '(org-appear :type git :host github :repo "awth13/org-appear"))
  (add-hook 'org-mode-hook 'org-appear-mode)

  ;;affiche les liens entier avec t
  ;; (setq org-appear-autolinks t)

#+end_src

***** Org font (police et taille des titres et checkbox)

Tout se trouve dans .dotfiles/.fonts

#+begin_src emacs-lisp

  ;;Pour obtenir des polices proportionnelles
  ;; (variable-pitch-mode 1)

  ;; Make sure org-indent face is available

  (require 'org-indent)

  (set-face-attribute 'org-document-title nil :font "Fira Mono" :weight 'bold :height 1.5)
  (dolist (face '((org-level-1 . 1.3)
                  (org-level-2 . 1.25)
                  (org-level-3 . 1.20)
                  (org-level-4 . 1.15)
                  (org-level-5 . 1.10)
                  (org-level-6 . 1.05)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    ;; (set-face-attribute (car face) nil :font "JetBrains Mono" :weight 'medium :height (cdr face))
    (set-face-attribute (car face) nil :font "Fira Mono" :weight 'medium :height (cdr face))
    )


  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  ;;couleur des checkbox
  (defface org-checkbox-todo-text
    '((t (:inherit org-todo)))
    "Face for the text part of an unchecked org-mode checkbox.")

  (font-lock-add-keywords
   'org-mode
   `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?: \\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)" 1 'org-checkbox-todo-text prepend))
   'append)

  (defface org-checkbox-done-text
    '((t (:inherit org-done)))
    "Face for the text part of a checked org-mode checkbox.")

  (font-lock-add-keywords
   'org-mode
   `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)" 1 'org-checkbox-done-text prepend))
   'append)

#+end_src
***** Nouveau symbole à fin de titres

#+begin_src emacs-lisp

  (setq org-ellipsis "⬎")

  ;; (setq org-ellipsis " ")

#+end_src

***** Voir directement les images + leur ajuster leur taille

#+begin_src emacs-lisp
(setq org-startup-with-inline-images t)
(setq org-image-actual-width 800)  
#+end_src

***** Voir les prévisualisations de latex 

#+BEGIN_SRC emacs-lisp   
  (use-package org-fragtog
    :hook (org-mode . org-fragtog-mode)
    )
#+END_SRC

***** Indente automatiquement en fonction des titres (attention, que visuel)

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (diminish org-indent-mode)
#+end_src


***** Jolie icones, ne marche pas chez moi (si mais fait buguer les icônes de dired)

#+begin_src emacs-lisp :tangle no

  (defun org-icons+todoicons ()
	   "Beautify org mode keywords."
	   (interactive)
	   (setq prettify-symbols-alist '(
					  ("TODO" . "")
					  ("PEUT-ÊTRE" . "")
					  ("EN-COURS" . "")
					  ("ANNULÉ" . "")
					  ("DONE" . "")
					  ("[#A]" . "")
					  ("[#B]" . "")
					  ("[#C]" . "")
					  ("-" . "➤")
					  ("[ ]" . "")
					  ("[X]" . "")
					  ("[-]" . "")
					  ("#+begin_src" . ?)
					  ("#+BEGIN_SRC" . ?)
					  ("#+end_src" . ?)
					  ("#+END_SRC" . ?)
					  (":PROPERTIES:" . "")
					  (":END:" . "―")
					  ("#+STARTUP:" . "")
					  ("#+TITLE: " . "")
					  ("#+RESULTS:" . "")
					  ("#+NAME:" . "")
					  (":ROAM_ALIASES:" . "")
					  ("#+FILETAGS:" . "")
					  ("#+HTML_HEAD:" . "")
					  ("#+SUBTITLE:" . "")
					  ("#+AUTHOR:" . "")
					  (":Effort:" . "")
					  ("SCHEDULED:" . "")
					  ("DEADLINE:" . "")
					  ))
	   (prettify-symbols-mode)
	   (magic-icon-fix)
	   )

  (defun magic-icon-fix ()
      (interactive)
	(let ((fontset (face-attribute 'default :fontset)))
	      (set-fontset-font fontset '(?\xf000 . ?\xf2ff) "FontAwesome" nil 'append)))



#+end_src

***** TODO Pour mettres les jolis tags :

#+begin_src emacs-lisp :tangle no

(use-package org-pretty-tags
  :config
   (setq org-pretty-tags-surrogate-strings
	 (quote
	  (("@office" . "✍")
	   ("PROJEKT" . "💡")
	   ("SERVICE" . "✍")
	   ("Blog" . "✍")
	   ("music" . "♬")
	   )))
   (org-pretty-tags-global-mode))

#+end_src

**** Pour coder dans org
***** Les langages chargé par org-babel

Do not load all to booste the startup time 

#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     ;; (ditaa      . t)
     (C          . t)
     ;; (dot        . t)
     (emacs-lisp . t)
     ;; (scheme     . t)
     ;; (gnuplot    . t)
     ;; (haskell    . t)
     (latex      . t)
     ;; (js         . t)
     ;; (ledger     . t)
     ;; (matlab     . t)
     ;; (ocaml      . t)
     ;; (octave     . t)
     ;; (plantuml   . t)
     (python     . t)
     ;; (R          . t)
     ;; (ruby       . t)
     ;; (screen     . nil)
     ;; (scheme     . t)
     (shell      . t)
     (sql        . t)
     (sqlite     . t)
     (java     . t)
     (js . t) ;;javascripts
     )
   )  
#+end_src
***** Annulation de la demande de confirmation lors de la demande d'évaluation du code
#+begin_src emacs-lisp 
  (setq org-confirm-babel-evaluate nil)
#+end_src
***** Indente le code selon le language
Dans les blocs de code, on veut la mise en évidence de syntaxe, et l'on
utilise la touche TAB pour indenter (et non pour insérer une tabulation)

#+begin_src emacs-lisp 
  (setq org-src-tab-acts-natively t)
#+end_src

#+begin_src emacs-lisp
  (setq org-src-fontify-natively t)
#+end_src
**** Latex
***** TODO Yasnippets de Latex dans org, désactive org bullet, à faire après les yasnippets

#+begin_src emacs-lisp :tangle no

  (defun my-org-latex-yas ()
    (yas-minor-mode)
    (yas-activate-extra-mode 'latex-mode)
    )


  (add-hook 'org-mode-hook 'my-org-latex-yas)
  
#+end_src
***** Les nouvelles classes latex

#+begin_src emacs-lisp

  (with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("org-plain-latex"
                   "\\documentclass{article}
                 [NO-DEFAULT-PACKAGES]
                 [PACKAGES]
                 [EXTRA]"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

)

)

#+end_src
**** Options sur les exports (sauf Latex) + Nouveaux exports org-modet
***** Options générales
****** Ignorer les headline avec le tag ignore:

#+begin_src emacs-lisp
  (with-eval-after-load 'org-contrib
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines))
    )
#+end_src
****** Ignorer les subtree avec le tag noexport
Rien besoin de faire, si ça change y mettre ici

***** Html
#+begin_src emacs-lisp 
  (use-package htmlize
    :config
    (setq org-html-doctype "html5")
    (setq org-html-indent nil) ;;indentation du code automatiquement si sur t, mais tue l'indentation des balise exemple, python etc
    )
#+end_src
***** Pour twitter (why not)
#+begin_src emacs-lisp
  (use-package ox-twbs)
#+end_src
***** Epub


#+begin_src emacs-lisp  
  (use-package ox-epub)
#+end_src




**** Notes collaboratives avec org-mode ([[https://floobits.com/help/plugins/emacs][ici]]) 



#+begin_src emacs-lisp :tangle no

(use-package floobits)

#+end_src


*** Choses dans le second cerveau

#+begin_src emacs-lisp
  (when braindump-exists
#+end_src

**** Gestion des liens

Deux stockage d'id : utilisé dans la db de org-roam, utiliser par org.
Quand on clique sur un lien, les deux marche.
Il faut dire à org où sont les fichiers avec les ids

***** Les id sont créés grâce à la date

#+begin_src emacs-lisp

  (setq org-id-method 'ts)
  (setq org-id-ts-format "%Y%m%d%H%M%S%6N") ;; le 6N est présent pour être sûr que se soit unique

#+end_src

(use-package org-id
  :straight nil
  :defer t
  :hook ((before-save . vulpea-id-auto-assign)
         (org-capture-prepare-finalize . org-id-get-create))
  :init
  (setq org-id-uuid-program
        "uuidgen | tr \"[:upper:]\" \"[:lower:]\"")
  :config
  (setq
   org-id-track-globally t
   org-id-extra-files
   (list (expand-file-name ".archive/archive" org-directory)
         (expand-file-name ".archive/archive.org" org-directory))
   org-id-link-to-org-use-id t
   org-id-locations-file (expand-file-name "org-id-locations"
                                           path-cache-dir)))

***** Ids chemin relatif

#+begin_src emacs-lisp
(setq org-id-locations-file-relative t)
#+end_src
***** Mise à jour des ids

#+begin_src emacs-lisp
  ;; (org-roam-update-org-id-locations) ;; =  org-directory and org-roam-directory
  (org-id-update-id-locations)


  ;; seul transclude en a besoin. Peut peut-être ralentir les choses

  (advice-add 'org-transclusion-add :before #'org-id-update-id-locations)

#+end_src
