config/org-mode.el

;; This implies that when that function is executed, the files whose
;; content is searched for IDs (i.e. they are scanned) are
;;
;; + The files mentioned in =org-agenda-files=.
;; + The archives associated to the files in =org-agenda-files=.
;; + The files mentioned in =org-id-locations=.
;; + The files provided as arguments to the =org-id-update-id-locations=.
;;
;; The following are not mentioned in the documentation of
;; =org-id-update-id-locations=, but when looking at the source code, you
;; can see that the value of the following variables is used
;;
;; + =org-id-extra-files=
;; + =org-id-files=
;;

;; (setq org-id-files (org-roam-list-files))

;;plus propre d'y mettre dans les extras
(setq org-id-extra-files (append(directory-files-recursively config-directory "org$") (org-roam-list-files)))

;; Update ID file .org-id-locations on startup
;; (org-id-update-id-locations)

(setq capture-inbox-file
    (expand-file-name (format "inbox-%s.org" (system-name)) org-roam-directory)
    )

;; (setq org-capture-templates
      ;; '(("t" "todo" plain (file capture-inbox-file)
         ;; "* TODO %?\n%U\n" )))

;; quand on donne un truc relatif, alors le org-directory est bien appelé ! Si je mets des fonctions pour les templates à récupéré ça ne marche plus. Obligé de laisser les capture templates dans le dossier braindump et en dehors du dossier org-directory (sinon la bdd dit double id)



;;les raccourcis ici ne sont pas important, mais doivent faire le liens entre TODO

;; (setq org-capture-templates-models (expand-file-name "templatesOrgCapture/" user-emacs-directory))

(setq org-capture-templates '
      (

       ("t" "Pour les timestamps")
       ("tt" "Tickler" entry
        (file (lambda() (concat orgzly-directory "AgendaTickler.org")))
        (file "templatesOrgCapture/tickler.org")
        :immediate-finish t
        )
       ("te" "Évènement sur plusieurs heures" entry
        (file (lambda() (concat orgzly-directory "AgendaTickler.org")))
        (file "templatesOrgCapture/evenement.org")
        :immediate-finish t
        )

       ("td" "Évènement sur plusieurs jours" entry
        (file (lambda() (concat orgzly-directory "AgendaTickler.org")))
        (file "templatesOrgCapture/evenementplusieursjours.org")
        :immediate-finish t
        )


       ("i" "Inbox (TODO)" entry
        (file (lambda() (concat orgzly-directory "Inbox.org")))
        (file "templatesOrgCapture/todo.org")
        :immediate-finish t
        )
       ("n" "Inbox (NEXT)" entry
        (file capture-inbox-file)
        (file "../templatesOrgCapture/next.org")
        :immediate-finish t
        )

       ("s" "Slipbox for org-roam" entry  (file "braindump/org/inbox.org")
        "* %?\n")

       ("d" "Journal de dissactifaction" entry (file  "org/journal_de_dissatisfaction.org")
        "* %<%Y-%m-%d> \n- %?")

       ("c" "Contacts" entry
        (file+headline (lambda() (concat orgzly-directory "Contacts.org" ))"Inbox")
        (file "templatesOrgCapture/contacts.org")
        ;; :immediate-finish t
        ;; :jump-to-captured t
        )

       ("a" "Image dans Artiste")

       ("at" "Image + artiste" entry (file  "org/artistes.org" )
        (file "templatesOrgCapture/artistes.org")
        :jump-to-captured 1
        )

       ("as" "Image" entry (file "org/artistes.org" )
        (file "templatesOrgCapture/image.org")
        ;; :jump-to-captured 1
        )

       ;; ici se trouve les choses utilisé pour org-protocol
       ;; pour mes raccourcis
       ("O" "Link capture" entry
        (file+headline "org/orgzly/Bookmarks.org" "INBOX")
        "* %a %U"
        :immediate-finish t)


       ;; ("P" "org-popup" entry (file+headline "braindump/org/inbox.org" "Titled Notes")
       ;; "%[~/.emacs.d/.org-popup]" :immediate-finish t :prepend t)
       )
      )

;; pour rajouter un ID OU DES COMMANDES à la fin de la capture !
(defun cp/org-capture-finalize ()
  "Comprend la valeur de la key de org capture et décide de faire qql après le capture ou pas"
  (let ((key  (plist-get org-capture-plist :key))
        (desc (plist-get org-capture-plist :description)))
    (if org-note-abort
        (message "Template with key %s and description “%s” aborted" key desc)
      (message "Template with key %s and description “%s” run successfully" key desc)
      )
    (when (string= key "A") 		;si jamais c'est A, alors faire la suite
      (org-capture-goto-last-stored)
      (org-id-get-create)	    
      )
    (when (string= key "t") 		;etc
      ;; (org-capture-goto-last-stored)
      ;; (org-schedule nil nil)
      ;; (winner-undo)
      )
    (when (string= key "e") 		;etc
      ;; (org-capture-goto-last-stored)
      ;; (org-schedule nil nil)
      ;; (winner-undo)
      )
    (when (string= key "as") 		;etc
      (org-capture-goto-last-stored)
      (newline)
      (newline)
      (org-download-clipboard)
      ;; (org-schedule nil nil)
      ;; (winner-undo)
      )
    )
  )

;; (add-hook 'org-capture-after-finalize-hook 'cp/org-capture-finalize)
