config/org-mode.org
****** Agenda custom command

#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
        '(
          (" " "Agenda"
           ((tags
             "REFILE"
             ((org-agenda-overriding-header "To refile")
              (org-tags-match-list-sublevels nil)))))

          ("d" "dashboard"
           (
            (todo "RAPPEL" ((org-agenda-overriding-header "Se souvenir de ceci")))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Actions")
                   (org-agenda-max-todos nil)))
            (todo "TODO"
                  ((org-agenda-overriding-header "Tout ce qui est dans Inbox(Unprocessed Inbox Tasks)")
                   (org-agenda-files capture-inbox-file))
                  (org-agenda-text-search-extra-files nil))
            (todo "WAIT"
                  ((org-agenda-overriding-header "Waiting items")
                   (org-agenda-max-todos nil)))
            ;;(stuck "") ;; review stuck projects as designated by org-stuck-projects
            ;; ...other commands here
            )
           )
          )
        )
#+end_src

****** Faire des requête avec des commandes

#+begin_src emacs-lisp
  (use-package org-ql)
#+end_src

***** Gestion de l'agenda (téléphone)


#+begin_src emacs-lisp
(use-package org-yaap
  :straight (org-yaap :type git :host gitlab :repo "tygrdev/org-yaap")
  :config
  (org-yaap-mode 1))
#+end_src


**** Gestion des tâches

***** Gestion des projet

****** Empêche les parent d'être coché si les fils ne le sont pas

#+begin_src emacs-lisp
(setq org-enforce-todo-dependencies t)
#+end_src

***** Gestions des habitues

#+begin_src emacs-lisp
(require 'org-habit)
;;pour que le logbook soit dans un tiroir

;;  Pour savoir qd fini une tâche
(setq org-log-done 'time)
(setq org-log-into-drawer t);; le mets dans un propreties
#+end_src

**** Gestion des tags (sauf tag "projet"), voir l'agenda

***** Nouvelle fonction pour ajout de tag

Fait appel à la fonction pour ajouter un tag à la personne 

#+begin_src emacs-lisp
  (defun vulpea-tags-add ()
    "Add a tag to current note."
    (interactive)
    ;; since https://github.com/org-roam/org-roam/pull/1515
    ;; `org-roam-tag-add' returns added tag, we could avoid reading tags
    ;; in `vulpea-ensure-filetag', but this way it can be used in
    ;; different contexts while having simple implementation.
    (when (call-interactively #'org-roam-tag-add)
      (vulpea-ensure-filetag)))

#+end_src


***** Personne

Cela permet de faire des projets également pour des personnes (Nell hehe)
Si je connais la personne, alors je la tag avec people. Si j'ai des choses en rapport à faire avec elle, alors je lui mets un tag "@NomDeLaPersonne"

Je peux chercher les tag dans l'agenda

Chaque personne à son fichier org roam.

Pour appeler une fonction qui ajoute les tags, et si jamais le tag people est mis, alors ajoute automatiquement le tag de la personne au fichier !!!  Pratique



****** Créer automatiquement le tag "NomPersonne" si la personne à le tag people

Appeler dans vulpea-tags-add

#+begin_src emacs-lisp
    (defun vulpea-ensure-filetag ()
      "Add respective file tag if it's missing in the current note."
      (let ((tags (vulpea-buffer-tags-get))
            (tag (vulpea--title-as-tag)))
        (when (and (seq-contains-p tags "PERSONNE")
                   (not (seq-contains-p tags tag)))
          (vulpea-buffer-tags-add tag))))

    (defun vulpea--title-as-tag ()
      "Return title of the current note as tag."
      (vulpea--title-to-tag (vulpea-buffer-title-get)))

    (defun vulpea--title-to-tag (title)
      "Convert TITLE to tag."
      (concat "@" (s-replace " " "" title)))

#+end_src

****** Automatisation insertion tag de la personne qd on la cite ailleurs ! 

Qd on insère avec la fonction vulpea-insert une personne ailleurs dans un todo, insère le tag automatiquement
#+begin_src emacs-lisp
(defun my-vulpea-insert-handle (note)
  "Hook to be called on NOTE after `vulpea-insert'."
  (when-let* ((title (vulpea-note-title note))
              (tags (vulpea-note-tags note)))
    (when (seq-contains-p tags "PERSONNE")
      (save-excursion
        (ignore-errors
          (org-back-to-heading)
          (when (eq 'todo (org-element-property
                           :todo-type
                           (org-element-at-point)))
            (org-set-tags
             (seq-uniq
              (cons
               (vulpea--title-to-tag title)
               (org-get-tags nil t))))))))))

(defun vulpea--title-to-tag (title)
  "Convert TITLE to tag."
  (concat "@" (s-replace " " "" title)))

(add-hook 'vulpea-insert-handle-functions
          #'my-vulpea-insert-handle)
#+end_src




***** Fonction qui demande TOUTES les tâches associé à une personne

#+begin_src emacs-lisp
(defun vulpea-agenda-person ()
  "Show main `org-agenda' view."
  (interactive)
  (let* ((person (vulpea-select
                  "Person"
                  :filter-fn
                  (lambda (note)
                    (seq-contains-p (vulpea-note-tags note)
                                    "PERSONNE"))))
         (node (org-roam-node-from-id (vulpea-note-id person)))
         (names (cons (org-roam-node-title node)
                      (org-roam-node-aliases node)))
         (tags (seq-map #'vulpea--title-to-tag names))
         (query (string-join tags "|")))
    (dlet ((org-agenda-overriding-arguments (list t query)))
      (org-agenda nil "M"))))
#+end_src


**** Gestion org transclution

Dépendant des ids dans id-locations.el

#+begin_src emacs-lisp

(use-package org-transclusion)

#+end_src

**** Gestion des fichiers et des dossiers en pièce jointe (org-attach)

***** Quand on rajoute un fichier en attachment, on store le link pour l'insertion

#+begin_src emacs-lisp
  (setq org-attach-store-link-p 'file)
  ;; pour que le lien soit relatif au dossier data, modifier cette fonction
  ;; org attach attach
#+end_src



***** On créer les dossier par années/mois/jour/lerest par rapport à la date de la création du noeud pour les rangements

#+begin_src emacs-lisp

  ;;The first function in this list defines the preferred function which will be used when creating new attachment folders.
  (setq org-attach-id-to-path-function-list
        '(org-attach-id-ts-folder-format
          org-attach-id-uuid-folder-format))


  (defun org-attach-id-ts-folder-format (id)
    "Translate an ID based on a timestamp to a folder-path.
  Useful way of translation if ID is generated based on ISO8601
  timestamp.  Splits the attachment folder hierarchy into
  year-month, the rest."
    (format "%s/%s/%s/%s"
            (substring id 0 4)
            (substring id 4 6)
            (substring id 6 8)
            (substring id 9)
            )
    )

#+end_src



***** Dired attachment

2 windows : une avec fichiers dired, l'autre avec le curseur sur le subtree ou attacher les fichiers
marquer les fichiers sur dired, appeler la fonction org-attach-dired-to-subtree, et voilà !


#+begin_src emacs-lisp
(add-hook 'dired-mode-hook
          (lambda ()
            (define-key dired-mode-map
              (kbd "C-c C-x a")
              #'org-attach-dired-to-subtree)))
#+end_src

              

***** Chemin de org attach

#+begin_src emacs-lisp
    ;; (setq org-attach-id-dir (expand-file-name ".data/" vulpea-directory))

  (setq org-attach-id-dir (expand-file-name ".data/" org-roam-directory))

#+end_src



