config/org-mode.org
***** Pour pouvoir attacher des dossiers

Patch de la fonction pour pouvoir attach des dossiers

#+begin_src emacs-lisp

  ;; (advice-remove 'org-attach-attach 'my-new-org-attach-attach)

  (defun org-attach-attach (file &optional visit-dir method)
    "Move/copy/link FILE into the attachment directory of the current outline node.
  If VISIT-DIR is non-nil, visit the directory with `dired'.
  METHOD may be `cp', `mv', `ln', `lns' or `url' default taken from
  `org-attach-method'."
    (interactive
     (list
      (read-file-name "File to keep as an attachment: "
                      (or (progn
                            (require 'dired-aux)
                            (dired-dwim-target-directory))
                          default-directory))
      current-prefix-arg
      nil))
    (setq method (or method org-attach-method))
    (when (file-directory-p file)
      (setq file (directory-file-name file)))
    (let ((basename (file-name-nondirectory file)))
      (let* ((attach-dir (org-attach-dir 'get-create))
             (attach-file (expand-file-name basename attach-dir)))
        (cond
         ((eq method 'mv) (rename-file file attach-file))
         ((eq method 'cp)
          (if (file-directory-p file)
              (copy-directory file attach-file nil nil t)
            (copy-file file attach-file)))
         ((eq method 'ln) (add-name-to-file file attach-file))
         ((eq method 'lns) (make-symbolic-link file attach-file))
         ((eq method 'url) (url-copy-file file attach-file)))
        (run-hook-with-args 'org-attach-after-change-hook attach-dir)
        (org-attach-tag)
        (cond ((eq org-attach-store-link-p 'attached)
               (push (list (concat "attachment:" (file-name-nondirectory attach-file))
                           (file-name-nondirectory attach-file))
                     org-stored-links))
              ((eq org-attach-store-link-p t)
               (push (list (concat "file:" file)
                           (file-name-nondirectory file))
                     org-stored-links))
              ((eq org-attach-store-link-p 'file)
               (push (list (concat "file:" attach-file)
                           (file-name-nondirectory attach-file))
                     org-stored-links)))
        (if visit-dir
            (dired attach-dir)
          (message "File %S is now an attachment" basename)))))

#+end_src


(defun my-new-org-attach-attach (file &optional visit-dir method)
    "Move/copy/link FILE into the attachment directory of the current outline node.
        If VISIT-DIR is non-nil, visit the directory with `dired'.
        METHOD may be `cp', `mv', `ln', `lns' or `url' default taken from
        `org-attach-method'."
    (interactive
     (list
      (read-file-name "File to keep as an attachment: "
                      (or (progn
                            (require 'dired-aux)
                            (dired-dwim-target-directory))
                          default-directory))
      current-prefix-arg
      nil))
    (setq method (or method org-attach-method))
    (let ((basename (file-name-nondirectory file)))
      (let* ((attach-dir (org-attach-dir 'get-create))
             (attach-file (expand-file-name basename attach-dir)))
        (cond
         ((eq method 'mv) (rename-file file attach-file))
         ((eq method 'cp) (if (file-directory-p file)
                              (copy-directory file
                                              (concat attach-file
                                                      (concat "/" (file-name-nondirectory
                                                                   (directory-file-name
                                                                    (file-name-directory file))))))
                            (copy-file file attach-file)
                            ))
         ((eq method 'ln) (add-name-to-file file attach-file))
         ((eq method 'lns) (make-symbolic-link file attach-file))
         ((eq method 'url) (url-copy-file file attach-file)))
        (run-hook-with-args 'org-attach-after-change-hook attach-dir)
        (org-attach-tag)
        (cond ((eq org-attach-store-link-p 'attached)
               (push (list (concat "attachment:" (file-name-nondirectory attach-file))
                           (file-name-nondirectory attach-file))
                     org-stored-links))
              ((eq org-attach-store-link-p t)
               (push (list (concat "file:" file)
                           (file-name-nondirectory file))
                     org-stored-links))
              ((eq org-attach-store-link-p 'file)
               (push (list (concat "file:" attach-file)
                           (file-name-nondirectory attach-file))
                     org-stored-links)))
        (if visit-dir
            (dired attach-dir)
          (if (string-equal basename "")

              (message "File %S is now an attachment" (file-name-nondirectory
                                                                   (directory-file-name
                                                                    (file-name-directory file))))
              (message "File %S is now an attachment" basename)
              )
          ))))

          



          

***** Pour automatiquement commit quand on rajoute un document

#+begin_src emacs-lisp
  (require 'org-attach-git)
#+end_src

**** Gestion des archives

#+begin_src emacs-lisp

  (use-package org-archive
    :straight nil
    :defer t
    :init
    (setq-default
     org-archive-location
     (concat braindump-directory "org/.archive/%s_archive" "::" "datetree/")
     org-archive-save-context-info
     '(time file ltags itags todo category olpath)))

  ;; (setq org-archive-location "%s_archive::* ArchivedTasksfrom%s")
#+end_src

**** Gestion de l'intéraction avec le pc

#+begin_src emacs-lisp
  (require 'org-protocol)
#+end_src

**** Publier son site
**** Fin du when
#+begin_src emacs-lisp
)
#+end_src


** Org-roam, seulement si ya mon braindump (logique)

#+begin_src emacs-lisp

  (use-package org-roam
    :if braindump-exists

#+end_src


*** Org-roam pur

**** Init

#+begin_src emacs-lisp
  :init
  ;;éviter d'avoir la nottif de version 1 à 2 
  (setq org-roam-v2-ack t)
#+end_src

**** Config

#+begin_src emacs-lisp
  :config
#+end_src


***** Test termux, plus besoin 

#+begin_src emacs-lisp :tangle no
  
  (when nil

    ;; this is a chunglak's hack to get sqlite to work on Android with org-roam v2:
    ;; from: https://github.com/org-roam/org-roam/issues/1605#issuecomment-885997237
    (defun org-roam-db ()
      "Entrypoint to the Org-roam sqlite database.
  Initializes and stores the database, and the database connection.
  Performs a database upgrade when required."
      (unless (and (org-roam-db--get-connection)
                   (emacsql-live-p (org-roam-db--get-connection)))
        (let ((init-db (not (file-exists-p org-roam-db-location))))
          (make-directory (file-name-directory org-roam-db-location) t)
          (let ((conn (emacsql-sqlite3 org-roam-db-location)))
            (emacsql conn [:pragma (= foreign_keys ON)])
            (set-process-query-on-exit-flag (emacsql-process conn) nil)
            (puthash (expand-file-name org-roam-directory)
                     conn
                     org-roam-db--connection)
            (when init-db
              (org-roam-db--init conn))
            (let* ((version (caar (emacsql conn "PRAGMA user_version")))
                   (version (org-roam-db--upgrade-maybe conn version)))
              (cond
               ((> version org-roam-db-version)
                (emacsql-close conn)
                (user-error
                 "The Org-roam database was created with a newer Org-roam version.  "
                 "You need to update the Org-roam package"))
               ((< version org-roam-db-version)
                (emacsql-close conn)
                (error "BUG: The Org-roam database scheme changed %s"
                       "and there is no upgrade path")))))))
      (org-roam-db--get-connection))
    (defun org-roam-db--init (db)
      "Initialize database DB with the correct schema and user version."
      (emacsql-with-transaction db
        (emacsql db "PRAGMA foreign_keys = ON") ;; added
        (emacsql db [:pragma (= foreign_keys ON)])
        (pcase-dolist (`(,table ,schema) org-roam-db--table-schemata)
          (emacsql db [:create-table $i1 $S2] table schema))
        (pcase-dolist (`(,index-name ,table ,columns) org-roam-db--table-indices)
          (emacsql db [:create-index $i1 :on $i2 $S3] index-name table columns))
        (emacsql db (format "PRAGMA user_version = %s" org-roam-db-version))))
    ;; end chunglak hack

    (org-roam-setup)



    )  

#+end_src


***** Amélioration mineur et completion

  ;;pour mes fichiers agenda prennent en compte les hook, il suffit de faire un revert

#+begin_src emacs-lisp


  ;; complétion et proprosition
  (setq org-roam-completion-everywhere t) ;; pour avoir la complétion partout avec company
  (setq completion-ignore-case t) ;; ne dépend pas de la case pour la complétion
  (with-eval-after-load 'company
    (add-to-list 'company-backends 'company-capf) ;;completion avec org-roam
    )

  (add-hook 'org-mode-hook 'company-mode)
  (add-hook 'org-mode-hook '(lambda () (company-box-mode 0)))

  ;; syncro automatique avec les fichiers
  (org-roam-db-autosync-mode)

  ;; pour améliorer les perf
  (setq org-roam-db-gc-threshold most-positive-fixnum)

  ;; On prend pas les fichiers org dans org-attach
  (setq org-roam-file-exclude-regexp ".data/")


#+end_src




