config/org-mode.org
***** Org-roam capture

#+begin_src emacs-lisp

  ;;ajout du tag BROUILLON tant que c'est pas fini
  (defun jethro/tag-new-node-as-draft ()
    (org-roam-tag-add '("BROUILLON")))
  (add-hook 'org-roam-capture-new-node-hook #'jethro/tag-new-node-as-draft)

  (setq org-roam-capture-templates
        '(
          ("d" "default" plain "%?"
           :target (file+head "pages/%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n")
           :unnarrowed t)
          ("i" "inbox" entry "* %?"
           :target
           (node  "Inbox")
           ;; :unnarrowed t
           )
          ("m" "main" plain
           "%?"
           :target (file+head "main/${slug}.org"
                              "#+title: ${title}\n")
           :immediate-finish t
           :unnarrowed t)
          ("r" "reference" plain "%?"
           :target
           (file+head "reference/${title}.org" "#+title: ${title}\n")
           :immediate-finish t
           :unnarrowed t)
          ("a" "article" plain "%?"
           :target
           (file+head "articles/${title}.org" "#+title: ${title}\n#+filetags: :article:\n")
           :immediate-finish t
           :unnarrowed t)
          )
        )

#+end_src

***** Journal

#+begin_src emacs-lisp
  ;;défini la capture de mon journal
  (setq org-roam-dailies-directory "journals/")
#+end_src

***** Buffer des backlinks

#+begin_src emacs-lisp

  ;;ce qu'il y a dans le buffer de backlinks
  (setq org-roam-mode-sections
        (list #'org-roam-backlinks-section
              #'org-roam-reflinks-section
              #'org-roam-unlinked-references-section
              ))

  ;; on peut mettre des options !
  ;; (org-roam-mode-sections
  ;; '((org-roam-backlinks-section :unique t)
  ;; org-roam-reflinks-section))
#+end_src

***** TODO Lors de la recherche d'un noeud, info sup

****** TODO Voir le nombre de backlinks d'une note + Utiliser la souris sur le buffer backlinks

#+begin_src emacs-lisp

  (with-eval-after-load 'org-roam
    (define-key org-roam-mode-map [mouse-1] #'org-roam-visit-thing)
    ;; for org-roam-buffer-toggle
    ;; Recommendation in the official manual
    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
                   (display-buffer-in-direction)
                   (direction . right)
                   (window-width . 0.33)
                   (window-height . fit-window-to-buffer)))
    ;;pour avoir le nombre de backlinks lorsque que l'on cherche un node
    (cl-defmethod org-roam-node-directories ((node org-roam-node))
      (if-let ((dirs (file-name-directory (file-relative-name (org-roam-node-file node) org-roam-directory))))
          (format "%s" (car (f-split dirs)))
        ""))
    (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
      (let* ((count (caar (org-roam-db-query
                           [:select (funcall count source)
                                    :from links
                                    :where (= dest $s1)
                                    :and (= type "id")]
                           (org-roam-node-id node)))))
        (format "%d" count)))
    )


#+end_src

****** TODO hiérarchie quand on cherche/insert une note

#+begin_src emacs-lisp


  (with-eval-after-load 'org-roam


    ;; pour avoir la hiérarchie lorsque c'est une sous note 
    (cl-defmethod org-roam-node-filetitle ((node org-roam-node))
    "Return the file TITLE for the node."
    (org-roam-get-keyword "TITLE" (org-roam-node-file node)))


    (cl-defmethod org-roam-node-hierarchy ((node org-roam-node))
    "Return the hierarchy for the node."
    (let ((title (org-roam-node-title node))
    (olp (org-roam-node-olp node))
    (level (org-roam-node-level node))
    (filetitle (org-roam-node-filetitle node)))
    (concat
    (if (> level 0) (concat filetitle " -> "))
    (if (> level 1) (concat (string-join olp " -> ") " -> "))
    title))) ;; soit disant une erreur ici, mais tout va bien

    )


    ;; (setq org-roam-node-display-template "${directories:15} ${tags:40} ${backlinkscount:1}")
    ;; (setq org-roam-node-display-template "${directories:10} ${tags:10} ${title:100} ${backlinkscount:6}")

#+end_src

****** Qu'est ce qu'on met lorsque l'on recherche un node (nombre = nombre de caractère)

#+begin_src emacs-lisp
  (with-eval-after-load 'org-roam
    ;; (setq org-roam-node-display-template "${directories:15} ${hierarchy:105} ${tags:40} ${backlinkscount:1}") ;;plus besion des fichiers


    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE."
      (condition-case nil
          (file-name-nondirectory
           (directory-file-name
            (file-name-directory
             (file-relative-name (org-roam-node-file node) org-roam-directory))))
        (error "")))

    (setq org-roam-node-display-template "${type:15} ${hierarchy:130} ${tags:40} ${backlinkscount:2}")

    )
#+end_src



**** Fin de use-package org-roam
#+begin_src emacs-lisp
)
#+end_src


*** Fonctionnalité en plus grâce à l'utilisation d' org-roam

***** Deft, pour chercher dans toutes les notes d'org-roam

#+begin_src emacs-lisp
  (use-package deft
    :after org-roam
    :config
    (setq deft-extensions '("org")
          deft-directory org-roam-directory
          deft-recursive t
          deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"
          deft-use-filename-as-title t)
    )
#+end_src


***** Convertir les fichiers org en markdown hugo

#+begin_src emacs-lisp
  (use-package ox-hugo
    :after org org-roam
    ;; :custom
    ;;à modifier
    ;; (org-hugo-base-dir "/home/msi/Documents/Projet/SitesWeb/braindump")
    )
#+end_src


***** Org roam ui (org roam server pour org roam v2)


La vue en bulle, comme Obsidian
Il faut que le serveur soit démarré
Se trouve à cette adresse http://127.0.0.1:35901/ 

#+begin_src emacs-lisp

  (when termux-p
    ;; This makes Emacs in Termux use your Android browser for opening urls
    (setq browse-url-browser-function 'browse-url-xdg-open)
    )

  (use-package org-roam-ui
    :after org-roam
    :straight
    (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
    ;; :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil)
    )

#+end_src






** Gestion des références/bibliographie 
*** Ce qu'il reste à fairepour org-cite (un jour)
:PROPERTIES:
:ID:       8aac069c-ecda-4a5f-82df-add2a7ddfdcb
:END:
   
1. trouver pour tout le temps print la bibliographie sans mettre print_bibliographie à la fin

2. 

3.
*** Comment ça marche avec org-cite ?
**** Pour l'installation de zotero + extension betterbitex
:PROPERTIES:
:ID:       e254ed4d-d47b-4b9d-9155-108772b8b2c7
:END:
Cela permet d'auto exporter la bibliothèque.

[[https://blog.tecosaur.com/tmio/2021-07-31-citations.html#using-csl][Bon site pour comprendre comment ça marche]]
Pour la gestion des références : installation de Zotero + [[https://github.com/retorquere/zotero-better-bibtex/releases/tag/v6.2.5][extension betterbibtex]] qui est sur github (voir un tuto pour l'installer)


1. In the main menu go to Tools > Add-ons
2. Select ‘Extensions’
3. Click on the gear in the top-right corner and choose ‘Install Add-on From File…’
4. Choose .xpi that you’ve just downloaded, click ‘Install’
5. Restart Zotero


puis on automatise l'exportation avec l'extension !
(Fichier->exporter bibliothèque, sélectionner Better BibLatex et cocher : exporter les notes et garder à jour ! )

([[https://retorque.re/zotero-better-bibtex/exporting/auto/][ici]])

**** Pour citar et citeproc
On utilise les package citar et citeproc. Le premier pour insérer les citations , le deuxième pour exporter
Il faut configurer la variable de la/les bibliothèques.

Pour résumé, il faut juste :
# #+bibliography: references.bib ;;pas besoins car remplacer par la variable juste en dessous
# [cite:@key]
# #+print_bibliography:

Pour exporter :
# #+cite_export: csl
ou bien juste :

(Pour la conversion de org-ref à org-cite, il suffit juste d'enlever une paire de crochet au références de org-ref, puis de remplacer le "&" par "@", et de moddifier le print_biblio en 
[[bibliography:../biblio.bib] ] , logique quoi et assez simple à faire je pense)
