config/org-mode.el

(setq org-roam-capture-templates
      '(
        ("d" "default" plain "%?"
         :target (file+head "pages/%<%Y%m%d%H%M%S>-${slug}.org"
                            "#+title: ${title}\n")
         :unnarrowed t)
        ("i" "inbox" entry "* %?"
         :target
         (node  "Inbox")
         ;; :unnarrowed t
         )
        ("m" "main" plain
         "%?"
         :target (file+head "main/${slug}.org"
                            "#+title: ${title}\n")
         :immediate-finish t
         :unnarrowed t)
        ("r" "reference" plain "%?"
         :target
         (file+head "reference/${title}.org" "#+title: ${title}\n")
         :immediate-finish t
         :unnarrowed t)
        ("a" "article" plain "%?"
         :target
         (file+head "articles/${title}.org" "#+title: ${title}\n#+filetags: :article:\n")
         :immediate-finish t
         :unnarrowed t)
        )
      )

;;défini la capture de mon journal
(setq org-roam-dailies-directory "journals/")

;;ce qu'il y a dans le buffer de backlinks
(setq org-roam-mode-sections
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            #'org-roam-unlinked-references-section
            ))

;; on peut mettre des options !
;; (org-roam-mode-sections
;; '((org-roam-backlinks-section :unique t)
;; org-roam-reflinks-section))

(with-eval-after-load 'org-roam
  (define-key org-roam-mode-map [mouse-1] #'org-roam-visit-thing)
  ;; for org-roam-buffer-toggle
  ;; Recommendation in the official manual
  (add-to-list 'display-buffer-alist
               '("\\*org-roam\\*"
                 (display-buffer-in-direction)
                 (direction . right)
                 (window-width . 0.33)
                 (window-height . fit-window-to-buffer)))
  ;;pour avoir le nombre de backlinks lorsque que l'on cherche un node
  (cl-defmethod org-roam-node-directories ((node org-roam-node))
    (if-let ((dirs (file-name-directory (file-relative-name (org-roam-node-file node) org-roam-directory))))
        (format "%s" (car (f-split dirs)))
      ""))
  (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
    (let* ((count (caar (org-roam-db-query
                         [:select (funcall count source)
                                  :from links
                                  :where (= dest $s1)
                                  :and (= type "id")]
                         (org-roam-node-id node)))))
      (format "%d" count)))
  )

(with-eval-after-load 'org-roam


  ;; pour avoir la hiérarchie lorsque c'est une sous note 
  (cl-defmethod org-roam-node-filetitle ((node org-roam-node))
  "Return the file TITLE for the node."
  (org-roam-get-keyword "TITLE" (org-roam-node-file node)))


  (cl-defmethod org-roam-node-hierarchy ((node org-roam-node))
  "Return the hierarchy for the node."
  (let ((title (org-roam-node-title node))
  (olp (org-roam-node-olp node))
  (level (org-roam-node-level node))
  (filetitle (org-roam-node-filetitle node)))
  (concat
  (if (> level 0) (concat filetitle " -> "))
  (if (> level 1) (concat (string-join olp " -> ") " -> "))
  title))) ;; soit disant une erreur ici, mais tout va bien

  )


  ;; (setq org-roam-node-display-template "${directories:15} ${tags:40} ${backlinkscount:1}")
  ;; (setq org-roam-node-display-template "${directories:10} ${tags:10} ${title:100} ${backlinkscount:6}")

(with-eval-after-load 'org-roam
  ;; (setq org-roam-node-display-template "${directories:15} ${hierarchy:105} ${tags:40} ${backlinkscount:1}") ;;plus besion des fichiers


  (cl-defmethod org-roam-node-type ((node org-roam-node))
    "Return the TYPE of NODE."
    (condition-case nil
        (file-name-nondirectory
         (directory-file-name
          (file-name-directory
           (file-relative-name (org-roam-node-file node) org-roam-directory))))
      (error "")))

  (setq org-roam-node-display-template "${type:15} ${hierarchy:130} ${tags:40} ${backlinkscount:2}")

  )

)

(use-package deft
  :after org-roam
  :config
  (setq deft-extensions '("org")
        deft-directory org-roam-directory
        deft-recursive t
        deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"
        deft-use-filename-as-title t)
  )

(use-package ox-hugo
  :after org org-roam
  ;; :custom
  ;;à modifier
  ;; (org-hugo-base-dir "/home/msi/Documents/Projet/SitesWeb/braindump")
  )

(when termux-p
  ;; This makes Emacs in Termux use your Android browser for opening urls
  (setq browse-url-browser-function 'browse-url-xdg-open)
  )

(use-package org-roam-ui
  :after org-roam
  :straight
  (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
  ;; :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start nil)
  )
