config/org-mode.el

(use-package citar
  ;; :after all-the-icons ;; besoin des icones pour charger les propositions
  :after oc-csl all-the-icons
  :custom
  ;;lieu de ma bibliographie
  (citar-bibliography (list (concat org-roam-directory "biblio.bib")))
  :config
  ;; pour complété avec consult yeah
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)

  ;; comment on gère l'affichage des propositions en dur
  (setq citar-templates
        '((main . "${author editor:30}     ${date year issued:4}     ${title:48}")
          (suffix . "          ${=key= id:15}    ${=type=:12}    ${tags keywords:*}")
          (preview . "${author editor} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.\n")
          (note . "Notes on ${author editor}, ${title}")))
  ;;le séparateur
  (setq citar-symbol-separator "  ")

  ;; et affichage des icônes à gauche
  (setq citar-symbols
        `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
          (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
          (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " ")))

  ;; automatiquement refresh lorque l'on modifie la bibliographie
  (setq citar-filenotify-callback 'refresh-cache)
  )

(use-package citeproc
  :straight (:host github :repo "andras-simonyi/citeproc-el")
  :after citar

  :init
  ;; nom du titre exporté pour la bibliographie
  (with-eval-after-load 'ox-hugo
    (plist-put org-hugo-citations-plist :bibliography-section-heading "References"))

  :config
  (setq org-cite-global-bibliography my-bibliography-list) ;; pour que org-cite sache où est ma biblio
  (setq org-cite-export-processors '((t csl)));; exporter tout le temps avec la méthode csl

  ;; les fichiers de configuration. Impossible de les configurer "normalement" (voir en dessous), j'utilise donc les fichiers "fallback" qui sont ceux par défaut
  ;; (setq org-cite-csl--fallback-style-file "/home/msi/documents/notes/braindump/org/chicago-author-date-16th-edition.csl") ;;


  ;;à remettre
  (setq org-cite-csl--fallback-style-file (concat org-roam-directory "vancouver-brackets.csl"));; pour changer le style. Vancouver = numéro
  (setq org-cite-csl--fallback-locales-dir org-roam-directory)
  )

;;le bordel ici, mais pas utilisé
;; pas utilisé, mais voir aussi les variable de jethro
;; (setq
;; org-cite-global-bibliography my-bibliography-list ;; pour que org-cite sache où est ma biblio
;; citar-format-reference-function 'citar-citeproc-format-reference
;; org-cite-csl-styles-dir "~/Zotero/styles/"
;; citar-citeproc-csl-styles-dir org-cite-csl-styles-dir
;; citar-citeproc-csl-locales-dir "~/Zotero/locales/"

;; doute sur lui, voir le dot de jethro
;; citar-citeproc-csl-style (concat (expand-file-name org-cite-csl-styles-dir
;; )"apa.csl")

;;pour que ça marche, il faut régler ces deux variables
;; après avoir exécuté ceci, les export marches TODO
;; org-cite-csl--fallback-style-file "/home/msi/documents/notes/braindump/org/reference/chicago-author-date-16th-edition.csl"
;; org-cite-csl--fallback-locales-dir "/home/msi/documents/notes/braindump/org/reference"
;; )

;; (setq org-cite-csl-styles-dir "~/Zotero/styles/")
;; (setq org-cite-csl-locales-dir "/home/msi/documents/notes/braindump/org/reference/")

(with-eval-after-load 'citar

    (defun jethro/org-roam-node-from-cite (keys-entries)
      (interactive (list (citar-select-ref :multiple nil :rebuild-cache t)))
      (let (
            (title (citar--format-entry-no-widths (cdr keys-entries)
                                                  "${author editor} ${title}"))
            )
        (org-roam-capture- :templates
                           '(("r" "reference" plain "%?" :target
                              (file+head "reference/${citekey}.org"
                                         "
:PROPERTIES:
:ROAM_REFS: [cite:@${citekey}]
:END:
#+title: ${title}\n\n\n- source :: [cite:@${citekey}]\nÉcrire ici\n#+print_bibliography:")
                              :immediate-finish t
                              :unnarrowed t))
                           :info (list :citekey (car keys-entries))
                           :node (org-roam-node-create :title title)
                           :props '(:finalize find-file))))
              )

(with-eval-after-load 'citar
  ;; pour ajouter la source, j'appelle cette fonction dans le capture, qui renvoie une chaîne de caractère, et le capture à besoin d'une fonction avec un argument
  (defun cp/ajoute-source-capture  (monargumentinutile)
    (let ((source (citar--format-entry-no-widths (cdr keys-entries)
                                                 "${author editor}. ${year}. \"${title url year}\" ${url}"))
          )
      ;;renvoie de la chaîne de caractère
      (message "%s" source)
      )
    )


  ;; pour ajouter la source, j'appelle cette fonction dans le capture, qui renvoie une chaîne de caractère, et le capture à besoin d'une fonction avec un argument
  (defun cp/ajoute-source-capture-main  (monargumentinutile)
    (interactive)
    (setq source (citar--format-entry-no-widths (cdr (citar-select-ref))
                                                "${author editor}. ${year}. \"${title}\" ${url}"))
    ;;renvoie de la chaîne de caractère
    (message "test")
    ;; (insert source)
    (with-current-buffer "*scratch*"
      (insert source)
      (end-of-line)
      (newline-and-indent))
    )



  )
